In [1]:
import pandas as pd

In [2]:
#Series de pandas
numeros=[1,2,3,4,5,6,7,8,9]
serie=pd.Series(numeros)
serie, type(serie)

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 pandas.core.series.Series)

In [9]:
#Dataframe de pandas
#Es una estructura de datos bidimensional con columnas de diferentes tipos, similar a una hoja de cálculo o una tabla SQL.
diccionario = {"Nombre":["Juan","Ana","Jose","Arturo"],"Edad":[25,18,23,27],"Ciudad":["Barcelona","Madrid","Bilbao","Valencia"]}

#Creación de un dataframe a partir de un diccionario
df =  pd.DataFrame(diccionario)
df

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    18     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia